Tekla.Structures.Drawing.Surfacing.SurfacingAttributes
The SurfacingAttributes class is the attributes class for the surfacing.

Tekla.Structures.Drawing.Surfacing.SurfacingAttributes.Representation
The representation type of the surfacing.

Tekla.Structures.Drawing.Surfacing.SurfacingAttributes.ShowPattern
True if the pattern is shown.

Tekla.Structures.Drawing.Surfacing.SurfacingAttributes.DrawHiddenLines
True if hidden lines are drawn.

Tekla.Structures.Drawing.Surfacing.SurfacingAttributes.DrawOwnHiddenLines
True if own hidden lines are enabled.

Tekla.Structures.Drawing.Surfacing.SurfacingAttributes.VisibleLines
The line type of visible lines.

Tekla.Structures.Drawing.Surfacing.SurfacingAttributes.HiddenLines
The line type of hidden lines.

Tekla.Structures.Drawing.Surfacing.SurfacingAttributes.#ctor(System.Boolean)
Creates a new default attributes instance that doesn't load attributes.

Tekla.Structures.Drawing.Surfacing.SurfacingAttributes.#ctor
Creates a new default surfacing attributes instance that loads standard attributes.

Tekla.Structures.Drawing.Surfacing.SurfacingAttributes.#ctor(System.String)
Creates a new surfacing attributes instance that loads the specified attributes.
AttributeFile: The name of the attribute file.

Tekla.Structures.Drawing.Surfacing.SurfacingAttributes.LoadAttributes(System.String)
Loads the attributes from the attribute file.
AttributeFile: The filename of the attribute file.
Returns: True if the attributes are loaded correctly. False if the attribute file loading failed.

Tekla.Structures.Drawing.Surfacing.SurfacingAttributes.IsEqual(System.Object)
Compares the current object with an object of the same type.
ObjectToCompare: The object to be used for comparing.
Returns: True if all the fields (except for the database GUID) of the objects match.